[
  {
    "type": "recipe_appetizer",
    "display_en": "Appetizer",
    "list": [
      {
        "name":"Roti Jala",
        "ingredients": [
          "200ml/7fl oz full-fat coconut milk",
          "1 free-range egg",
          "325g/11½oz plain flour",
          "1 tsp ground turmeric",
          "1 tsp salt",
          "vegetable oil, for frying"
        ],
        "instructions": [
          "Combine all the ingredients, except the oil, in a large mixing bowl. Whisk together until you achieve a smooth, lump-free batter. Rest the batter for 10 minutes at room temperature.",
          "Pour the batter into a roti jala dispenser. If you don’t have one, you can make your own by piercing five holes into the bottom of a plastic water bottle.",
          "Heat a non-stick frying pan over a medium heat. Add a small amount of oil to the pan and spread it around the base using a piece of kitchen paper to ensure an even coating.",
          "Using the roti jala dispenser or your homemade dispenser, pour the batter in a circular motion over the pan, creating a lacy pattern that covers the majority of the pan.",
          "Cook the roti jala for 1–2 minutes until it sets and the edges start to lift from the pan. Carefully remove the cooked roti jala from the pan and transfer to a plate to cool slightly. Once cooled, gently roll the roti jala up into a little roll.",
          "Repeat the process until all the batter is used up, adding a little oil to the pan as needed to prevent sticking.",
          "Serve the roti jala warm, with the chicken curry and dal."
        ]
      },
      {
        "name":"Kerabu Mangga",
        "ingredients": [
          "1⁄4 cup shrimps (dried)",
          "1 unripe mango",
          "1 lime",
          "7 shallots",
          "6 bird-eye chillies",
          "2 lemongrass stalks",
          "3 tbsp Thai palm sugar",
          "2 tbsp peanuts",
          "2 tbsp fish sauce"
        ],
        "instructions": [
          "Dry-fry the shrimps for 5 minutes over medium heat. Once cooled to room temperature, blend the dried shrimps. Set aside.",
          "Cut mango, shallots and chillies into thin slices. Take 6-8 cm of the lemongrass from the bottom and discard the top. Then, bash it with the back of the knife or pestle. Cut the lime into wedges.",
          "Add Thai palm sugar, shallots, chillies and lemongrass into a bowl. Add 2 tablespoons of lime juice followed by the sliced mango. Mix well. Lastly, stir in the blended dry shrimps. Garnish with some roasted peanuts."
        ]
      }
    ]
  },
  {
    "type": "recipe_maincourse",
    "display_en": "Main Course",
    "list": []
  },
  {
    "type": "recipe_snack",
    "display_en": "Snack",
    "list": []
  },{
    "type": "recipe_beverage",
    "display_en": "Beverage",
    "list": []
  },{
    "type": "recipe_dessert",
    "display_en": "Dessert",
    "list": []
  }
]